Repository: ZeyadSobhy03/blood_donation_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# onboarding_1_title
source: Welcome to LifeLink
ar: مرحباً بك في LifeLink

# onboarding_1_subTitle
source: Smart Blood Donation App
ar: تطبيق ذكي للتبرع بالدم

# onboarding_1_desc_1
source: Connecting donors with those in need, saving lives one donation at a time.
ar: ربط المتبرعين بالمحتاجين، وإنقاذ الأرواح من خلال كل تبرع.

# onboarding_2_title
source: The Problem
ar: المشكلة

# onboarding_2_subTitle
source: Current Challenges
ar: التحديات الحالية

# onboarding_2_desc_1
source: Difficulty finding donors quickly in emergencies
ar: صعوبة العثور على المتبرعين بسرعة في حالات الطوارئ

# onboarding_2_desc_2
source: No centralized donor database
ar: لا يوجد قاعدة بيانات مركزية للمتبرعين

# onboarding_2_desc_3
source: Lack of motivation for repeat donations
ar: نقص الحافز للتبرع المتكرر

# onboarding_3_title
source: The Solution
ar: الحل

# onboarding_3_subTitle
source: Our Features
ar: مميزاتنا

# onboarding_3_desc_1
source: Fast GPS-based donor matching
ar: مطابقة المتبرعين بسرعة باستخدام GPS

# onboarding_3_desc_2
source: Instant emergency notifications
ar: إشعارات فورية للطوارئ

# onboarding_3_desc_3
source: Rewards system for donors
ar: نظام مكافآت للمتبرعين

# onboarding_4_title
source: Make a Difference
ar: اصنع فرقاً

# onboarding_4_subTitle
source: Join Our Community
ar: انضم إلى مجتمعنا

# onboarding_4_desc_1
source: Every donation can save up to 3 lives. Be a hero in your community.
ar: كل تبرع يمكن أن ينقذ حتى 3 أرواح. كن بطلاً في مجتمعك.

# button_skip
source: Skip
ar: تخطي

# button_back
source: Back
ar: رجوع

# button_next
source: Next
ar: التالي

# button_get_started
source: Get Started
ar: ابدأ الآن

# choose_role_title
source: Choose Your Role
ar: اختر دورك

# choose_role_subTitle
source: How would you like to use LifeLink?
ar: كيف تريد استخدام LifeLink؟

# role_blood_donor_title
source: Blood Donor
ar: متبرع بالدم

# role_blood_donor_desc
source: Register as a donor, track donations, earn rewards
ar: سجل كمتبرع، تتبع التبرعات، واحصل على مكافآت

# role_blood_donor_button
source: Continue as Blood Donor
ar: استمر كمتبرع بالدم

# role_hospital_title
source: Hospital/Patient
ar: مستشفى / مريض

# role_hospital_desc
source: Request blood, find nearby donors, manage requests
ar: اطلب الدم، اعثر على المتبرعين القريبين، إدارة الطلبات

# role_hospital_button
source: Continue as Hospital/Patient
ar: استمر كمستشفى / مريض

# role_admin_title
source: Admin
ar: المسؤول

# role_admin_desc
source: Manage users, monitor donations, oversee the system
ar: إدارة المستخدمين، متابعة التبرعات، الإشراف على النظام

# role_admin_button
source: Continue as Admin
ar: استمر كمسؤول

# reviewConfirmTitle
source: Review & Confirm
ar: مراجعة وتأكيد

# reviewConfirmSubtitle
source: Please review your appointment details
ar: من فضلك راجع تفاصيل موعد التبرع

source: Before You Donate
ar: قبل التبرع

# donationTipEat
source: Eat a healthy meal before donation
ar: تناول وجبة صحية قبل التبرع

# donationTipWater
source: Drink plenty of water
ar: اشرب كمية كافية من الماء

# donationTipId
source: Bring a valid ID
ar: أحضر بطاقة هوية سارية

# donationTipSleep
source: Get a good night's sleep
ar: احصل على قسط كافٍ من النوم

source: Confirm appointment
ar: تأكيد الموعد

# chooseLocationTitle
source: Choose Location
ar: اختر الموقع

# chooseLocationSubtitle
source: Where would you like to donate?
ar: أين تود التبرع؟

# selectDateTimeTitle
source: Select Date & Time
ar: اختيار التاريخ والوقت

# selectDateTimeSubtitle
source: When would you like to donate?
ar: متى تود التبرع؟

# selectDateLabel
source: Select Date
ar: اختر التاريخ

# selectTimeLabel
source: Select Time
ar: اختر الوقت

# donationTypeLabel
source: Donation Type
ar: نوع التبرع

# datePlaceholder
source: mm/dd/yyyy
ar: يوم / شهر / سنة

# continueStep
source: Continue
ar: متابعة

# confirmDetailsTitle
source: Confirm Your Details
ar: تأكيد البيانات

# confirmDetailsSubtitle
source: Please verify your information
ar: من فضلك تأكد من صحة بياناتك

# firstNameLabel
source: First Name
ar: الاسم الأول

# lastNameLabel
source: Last Name
ar: اسم العائلة

# phoneNumberLabel
source: Phone Number
ar: رقم الهاتف

# emailAddressLabel
source: Email Address
ar: البريد الإلكتروني

# firstNameHint
source: Ziyad
ar: زياد

# lastNameHint
source: Sobhy
ar: صبحي

# appointmentConfirmedTitle
source: Appointment Confirmed!
ar: تم تأكيد الموعد!

# appointmentConfirmedSubtitle
source: Your donation appointment has been successfully scheduled
ar: تم جدولة موعد التبرع بنجاح

# whatsNextTitle
source: What's Next:
ar: ماذا بعد؟

# nextStepEmail
source: You'll receive a confirmation email
ar: ستصلك رسالة تأكيد عبر البريد الإلكتروني

# nextStepReminder
source: We'll send you a reminder 24 hours before
ar: سنرسل لك تذكيرًا قبل الموعد بـ 24 ساعة

# nextStepId
source: Bring a valid ID on the day of donation
ar: أحضر بطاقة هوية سارية يوم التبرع

source: Back to Home
ar: العودة للرئيسية

source: Add to calendar
ar: إضافة إلى التقويم

# scheduleDonationTitle
source: Schedule Donation
ar: جدولة التبرع

# scheduleStepCounter
source: Step {current} of {total}
ar: الخطوة {current} من {total}

# locationLabel
source: Location
ar: المكان

# whenLabel
source: When
ar: الوقت

# chooseBloodType
source: Choose a Blood Type
ar: اختر نوع الدم

source: Whole Blood
ar: دم كامل

source: Plasma
ar: بلازما

source: Platelets
ar: صفائح دموية

source: Double Red Cells
ar: خلايا حمراء مزدوجة

# noteMessage
source: Note: Appointments are typically available 24-48 hours in advance. Walk-ins are welcome during business hours.
ar: ملاحظة: المواعيد عادة متاحة قبل 24-48 ساعة. الزيارات المباشرة مرحب بها خلال ساعات العمل.

source: Location
ar: الموقع

source: Date & Time
ar: التاريخ والوقت

source: Donation Type
ar: نوع التبرع

# contactInfo
source: Contact Information
ar: معلومات الاتصال

source: Not selected
ar: غير محدد

source: no email
ar: لا يوجد بريد إلكتروني

source: no phone
ar: لا يوجد رقم هاتف

# chooseTimeSlot
source: Choose a time slot
ar: اختر توقيت التبرع

source: Confirm Response
ar: تأكيد الاستجابة

# emergencyRequestQuestion
source: Are you available to respond to this emergency blood request?
ar: هل أنت متاح للرد على هذا الطلب الطارئ للتبرع بالدم؟

# acceptButton
source: Accept - I Can Help
ar: موافق - أستطيع المساعدة

# declineButton
source: Decline - Not Available
ar: رفض - غير متاح

source: Donation Status
ar: حالة التبرع

# nextDonationReady
source: Next donation: Ready now
ar: التبرع القادم: جاهز الآن

source: Donor
ar: متبرع

source: What happens next:
ar: ما سيحدث بعد ذلك:

# hospitalNotified
source: Hospital will be notified of your response
ar: سيتم إخطار المستشفى بردك

# directionsAndContact
source: You'll receive directions and contact details
ar: ستتلقى الإرشادات وتفاصيل الاتصال

# arriveOnTime
source: Please arrive within the estimated time
ar: يرجى الوصول في الوقت المقدر

source: Urgent Requests
ar: الطلبات العاجلة

source: Active
ar: نشطة

source: Donate Now
ar: تبرع الآن

source: Respond
ar: الرد

# welcomeBack
source: Welcome back, {name}!
ar: مرحبًا بك مجددًا، {name}!

# readyToSaveLives
source: Ready to save lives today?
ar: هل أنت مستعد لإنقاذ الأرواح اليوم؟

source: Eligible to donate
ar: مؤهل للتبرع

source: Donations
ar: التبرعات

source: Points
ar: النقاط

source: Lives Saved
ar: الأرواح المنقذة

source: Request Details
ar: تفاصيل الطلب

source: Posted
ar: تاريخ النشر

source: Patient Type
ar: نوع المريض

source: Contact
ar: رقم الاتصال

source: I Can Help - Respond Now
ar: أستطيع المساعدة - الرد الآن

source: Not Available
ar: غير متاح

source: Why Your Response Matters
ar: لماذا ردك مهم

# responseMattersDescription
source: Your blood type matches this urgent request. Your quick response could save a life. The patient needs 3 units of O+ blood for emergency surgery.
ar: فصيلة دمك تطابق هذا الطلب العاجل. استجابتك السريعة قد تنقذ حياة. يحتاج المريض إلى 3 وحدات دم O+ لعملية طارئة.

source: Blood Type Needed
ar: فصيلة الدم المطلوبة

source: Urgent Request Active
ar: طلب عاجل نشط

source: Units Needed
ar: عدد الوحدات المطلوبة

source: Distance
ar: المسافة

source: Open in Map
ar: افتح في الخريطة

source: Map View
ar: عرض الخريطة

source: Emergency Request
ar: طلب عاجل

source: Critical Request
ar: طلب حرج

source: EMERGENCY
ar: عاجل

source: CRITICAL
ar: حرج

source: units
ar: وحدات

source: Home
ar: الرئيسية

source: Find
ar: بحث

source: Donate
ar: تبرع

source: Rewards
ar: المكافآت

source: Profile
ar: الملف الشخصي
